Creating a Series

In [106]:
import pandas as pd
import numpy as np

In [107]:
series1 = pd.Series(list('abcdef'))
series1

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [108]:
np_array = np.array([1,2,3,4,5,6,7,8,9])
series2 = pd.Series(np_array)
series2

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

Creating Panda Series from a dict

In [109]:
dict_country_gdp = pd.Series([2255.225482,629.9553062,11601.63022,25306.82494,27266.40335,19466.99052,588.3691778,2890.345675,
                              24733.62696,1445.760002,4803.398244,2618.876037,590.4521124,665.7982328,7122.938458,2639.54156,
                              3362.4656,15378.16704,30860.12808,2579.115607,6525.541272,229.6769525,2242.689259,27570.4852,
                              23016.84778,1334.646773,402.6953275,6047.200797,394.1156638,385.5793827,1414.072488,5745.981529,
                              837.7464011,1206.991065,27715.52837,18937.24998,39578.07441,478.2194906,16684.21278,279.2204061,
                              5345.213415,6288.25324,1908.304416,274.8728621,14646.42094,40034.85063,672.1547506,3359.517402,
                              36152.66676,3054.727742,33529.83052,3825.093781,15428.32098,33630.24604,39170.41371,2699.123242,
                              21058.43643,28272.40661,37691.02733,9581.05659,5671.912202,757.4009286,347.7456605],index =['Algeria',
                            'Angola','Argentina','Australia','Austria','Bahamas','Bangladesh','Belarus','Belgium','Bhutan','Brazil',
                            'Bulgaria','Cambodia','Cameroon','Chile','China','Colombia','Cyprus','Denmark','El Salvador','Estonia',
                            'Ethiopia','Fiji','Finland','France','Georgia','Ghana','Grenada','Guinea','Haiti','Honduras','Hungary',
                            'India','Indonesia','Ireland','Italy','Japan','Kenya', 'South Korea','Liberia','Malaysia','Mexico',
                            'Morocco','Nepal','New Zealand','Norway','Pakistan', 'Peru','Qatar','Russia','Singapore','South Africa',
                            'Spain','Sweden','Switzerland','Thailand', 'United Arab Emirates','United Kingdom','United States',
                            'Uruguay','Venezuela','Vietnam','Zimbabwe'])

In [110]:
print(dict_country_gdp)

Algeria           2255.225482
Angola             629.955306
Argentina        11601.630220
Australia        25306.824940
Austria          27266.403350
                     ...
United States    37691.027330
Uruguay           9581.056590
Venezuela         5671.912202
Vietnam            757.400929
Zimbabwe           347.745660
Length: 63, dtype: float64

Creating a series from a scalar

In [111]:
scalarSeries = pd.Series(5., index=['a','b','c','d','e','f'])
scalarSeries

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
f    5.0
dtype: float64

Accessing Elements in a Series

In [112]:
dict_country_gdp[0]

2255.225482

In [113]:
dict_country_gdp[:5] #Accessing first five countries

Algeria       2255.225482
Angola         629.955306
Argentina    11601.630220
Australia    25306.824940
Austria      27266.403350
dtype: float64

In [114]:
dict_country_gdp[-5:] #Accessing last five countries

United States    37691.027330
Uruguay           9581.056590
Venezuela         5671.912202
Vietnam            757.400929
Zimbabwe           347.745660
dtype: float64

In [115]:
dict_country_gdp.loc['India'] #This method is used to access the element using the value of Index

837.7464011

In [116]:
dict_country_gdp.iloc[20]  #This method is used to acces the element using the Index number

6525.541272

Vectorized operations in Seriess

In [117]:
vectorSeries1 = pd.Series([1,2,3,4,5], index =['a','b','c','d','e'])
vectorSeries2 = pd.Series([10,20,30,40,50], index = ['a','b','c','d','e'])

In [118]:
vectorSeries1+vectorSeries2

a    11
b    22
c    33
d    44
e    55
dtype: int64

Creating a DataFrame from Lists

In [119]:
import pandas as pd

In [120]:
#Create a DataFrame from dict of lists of equal leangth
olympicDataList = {'HostCity': ['London','Beijing','Athens','Sydney','Atlanta'],
                  'Year': [2012,2008,2004,2000,1996],
                  'No. of Participants': [205,204,201,200,197]}

In [121]:
df_olympicData = pd.DataFrame(olympicDataList)
df_olympicData

  HostCity  Year  No. of Participants
0   London  2012                  205
1  Beijing  2008                  204
2   Athens  2004                  201
3   Sydney  2000                  200
4  Atlanta  1996                  197

In [122]:
df_olympicData.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [123]:
df_olympicData.describe()

              Year  No. of Participants
count     5.000000             5.000000
mean   2004.000000           201.400000
std       6.324555             3.209361
min    1996.000000           197.000000
25%    2000.000000           200.000000
50%    2004.000000           201.000000
75%    2008.000000           204.000000
max    2012.000000           205.000000

In [124]:
#Create a DataFrame from Dict
df_olympicData = {'London': {2012:205},'Beijing':{2008:204}}

In [125]:
df_olympicDataDict =pd.DataFrame(olympicDataDict)
df_olympicDataDict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

Creating a DataFrame from Seriess

In [126]:
olympicSeriesParticipation = pd.Series([205,204,201,200,197], index = [2012,2008,2004,2000,1996])
olympicSeriesCountry = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'], index = [2012,2008,2004,2000,1996])

In [127]:
df_olympicSeries = pd.DataFrame({'No. Of Participants':olympicSeriesParticipation, 'HostCity':olympicSeriesCountry})

In [128]:
df_olympicSeries

      No. Of Participants HostCity
2012                  205   London
2008                  204  Beijing
2004                  201   Athens
2000                  200   Sydney
1996                  197  Atlanta

Create a DataFrame from ndarray

In [129]:
import numpy as np

In [130]:
np_array = np.array([2012,2008,2004,2000,1996])
dict_ndarray = {'Year':np_array}
df_ndarray = pd.DataFrame(dict_ndarray)
df_ndarray

   Year
0  2012
1  2008
2  2004
3  2000
4  1996

View and Select Data

In [131]:
#Import libraries
import numpy as np
import pandas as pd

In [132]:
#Creating a DataFrame from the dict of Series
olympicSeriesParticipation = pd.Series([205,204,201,200,197], index = [2012,2008,2004,2000,1996])
olympicSeriesCountry = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'], index = [2012,2008,2004,2000,1996])
df_olympicSeries = pd.DataFrame({'HostCity':olympicSeriesCountry,'No. Of Participants':olympicSeriesParticipation})
df_olympicSeries

     HostCity  No. Of Participants
2012   London                  205
2008  Beijing                  204
2004   Athens                  201
2000   Sydney                  200
1996  Atlanta                  197

In [133]:
#View DataFrame describe
df_olympicSeries.describe
#This will display entire content of the DataFrame as an output

<bound method NDFrame.describe of      HostCity  No. Of Participants
2012   London                  205
2008  Beijing                  204
2004   Athens                  201
2000   Sydney                  200
1996  Atlanta                  197>

In [134]:
#View DataFrame statisctical Properties
df_olympicSeries.describe()
#This will desplay the statictical properties of all the columns that have numeric values

       No. Of Participants
count             5.000000
mean            201.400000
std               3.209361
min             197.000000
25%             200.000000
50%             201.000000
75%             204.000000
max             205.000000

In [135]:
#View top 2 rows
df_olympicSeries.head(2)

     HostCity  No. Of Participants
2012   London                  205
2008  Beijing                  204

In [136]:
#View bottom 3 rows
df_olympicSeries.tail(3)

     HostCity  No. Of Participants
2004   Athens                  201
2000   Sydney                  200
1996  Atlanta                  197

In [137]:
#View indexes of Datasets
df_olympicSeries.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [138]:
#View columns of the DataSet
df_olympicSeries.columns

Index(['HostCity', 'No. Of Participants'], dtype='object')

Select Data

In [139]:
#Select Data for HostCities
df_olympicSeries['HostCity']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: HostCity, dtype: object

In [140]:
#select data for No.of Participants
df_olympicSeries['No. Of Participants']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No. Of Participants, dtype: int64

In [141]:
#select Lable-location based access by label
df_olympicSeries.loc[2012]

HostCity               London
No. Of Participants       205
Name: 2012, dtype: object

In [142]:
#Integer-locatiom based indexing by position
df_olympicSeries.iloc[:2]

     HostCity  No. Of Participants
2012   London                  205
2008  Beijing                  204

In [143]:
#Integer-location based data selection by index value
df_olympicSeries.iat[3,1]

200

In [144]:
#Select data element by condition where there is huge data using boolean expression
df_olympicSeries[df_olympicSeries['No. Of Participants']>200]

     HostCity  No. Of Participants
2012   London                  205
2008  Beijing                  204
2004   Athens                  201

Missing Values.\
Various factors may lead to missing data:\
1.Data not provided at source.\
2.Software Issue.\
3.Data Integration Issue.\
4.Network Issue.

Handling Missing Values

In [145]:
import pandas as pd

In [146]:
#declare first series
series1 = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])
#declare second series
series2 = pd.Series([10,20,30,40,50], index = ['c','e','f','g','h'])

In [147]:
seriesSum = series1 + series2
seriesSum

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

dropna function drops all the values with uncommom indicies

In [148]:
dropped = seriesSum.dropna()
dropped

c    13.0
e    25.0
dtype: float64

fillna function fills all the uncommon indicies instead of dropping them

In [149]:
filled = seriesSum.fillna(seriesSum.mean())
filled

a    19.0
b    19.0
c    13.0
d    19.0
e    25.0
f    19.0
g    19.0
h    19.0
dtype: float64

In [150]:
#fill Nan with zeros before performing addition operation for missing values
fillNanWithZeros = series1.add(series2, fill_value = 0)
fillNanWithZeros

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

Data Operations.\
Data operation can be performed through various built-in methods for faster data processing.

In [151]:
import pandas as pd

In [152]:
#Declare movie rating dataframe
df_movieRating = pd.DataFrame(
                            {'movie1': [5,4,3,3,2,1],
                            'movie2': [4,5,2,3,4,2]},
                            index = ['Tom','Jeff','Peter','Ram','Ted','Paul'])
df_movieRating

       movie1  movie2
Tom         5       4
Jeff        4       5
Peter       3       2
Ram         3       3
Ted         2       4
Paul        1       2

while performing Data operation, custom functions can be applied with applymap method

In [153]:
def movieGrade(rating):
    if rating ==5:
        return 'A'
    if rating ==4:
        return 'B'
    if rating ==3:
        return 'C'
    else:
        return 'F'

In [154]:
print(movieGrade(5))

A

In [155]:
df_movieRating.applymap(movieGrade)

      movie1 movie2
Tom        A      B
Jeff       B      A
Peter      C      F
Ram        C      C
Ted        F      B
Paul       F      F

Data Operations with Statistical Functions

In [156]:
df_testScores = pd.DataFrame(
                            {'Test1':[95,84,73,88,82,61],
                            'Test2':[74,85,82,73,77,79]},
                            index = ['Jack','Lewis','Patrick','Rich','Kelly','Paula'])
df_testScores

         Test1  Test2
Jack        95     74
Lewis       84     85
Patrick     73     82
Rich        88     73
Kelly       82     77
Paula       61     79

In [157]:
df_testScores.max()

Test1    95
Test2    85
dtype: int64

In [158]:
df_testScores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [159]:
df_testScores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

Data Operation using groupby function.

In [160]:
df_presidentsName = pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],
                                 'last':['Bush','Clinton','Regan','Carter','Washington']})
df_presidentsName

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [161]:
grouped = df_presidentsName.groupby('first')

In [162]:
grp_data = grouped.get_group('George')
grp_data

    first        last
0  George        Bush
4  George  Washington

Data Operation using Sorting

In [163]:
df_presidentsName.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

Data Standardization

In [164]:
df_testScores = pd.DataFrame(
                            {'Test1':[95,84,73,88,82,61],
                            'Test2':[74,85,82,73,77,79]},
                            index = ['Jack','Lewis','Patrick','Rich','Kelly','Paula'])
df_testScores

         Test1  Test2
Jack        95     74
Lewis       84     85
Patrick     73     82
Rich        88     73
Kelly       82     77
Paula       61     79

In [165]:
def standardizeTest(test):
    return (test-test.mean()/test.std())

In [166]:
standardizeTest(df_testScores['Test1'])

Jack       88.27999
Lewis      77.27999
Patrick    66.27999
Rich       81.27999
Kelly      75.27999
Paula      54.27999
Name: Test1, dtype: float64

In [167]:
def stanrdizeTestScores(dataFrame):
    return dataFrame.apply(standardizeTest)

In [168]:
stanrdizeTestScores(df_testScores)

            Test1      Test2
Jack     88.27999  57.093088
Lewis    77.27999  68.093088
Patrick  66.27999  65.093088
Rich     81.27999  56.093088
Kelly    75.27999  60.093088
Paula    54.27999  62.093088

Pandas Data Operations: Merge, Duplicate and Concatination.

In [169]:
import pandas as pd

In [175]:
maths = pd.DataFrame({'student':['Tom', 'Jack', 'Dan', 'Ram', 'Jeff','David'],
                     'ID':[10,56,31,85,9,22]})
science = pd.DataFrame({'student':['Tom', 'Ram', 'David'],
                       'ID':[10,12,22]})

In [176]:
#Merged maths and science dataframe and formed a new dataframe named merged
merged = pd.merge(maths, science)

In [177]:
merged

  student  ID
0     Tom  10
1   David  22

In [178]:
#merge with key on students
pd.merge(maths, science, on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [179]:
#merge left join on key id and also fill NaN values with x
pd.merge(maths, science, on='ID',how='left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [180]:
#Concatenate DataFrames
pd.concat([maths,science],ignore_index=True)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [181]:
#Define new DataFrame with student survey data
students =pd.DataFrame({'student':['Tom', 'Jack', 'Tom', 'Ram', 'Jeff','Jack'],
                     'ID':[10,56,10,85,9,56]})

In [182]:
students

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [183]:
#check for duplicate values.
students.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [185]:
#drop duplicated values with student as key
students.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [186]:
#drop duplicate values with ID as key
students.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

# Reading Files of diff types and writing files to certain file types.
pd.read_csv : read files from csc files(comma seperated values).\
pd.to_csv : writes the files into csv files.\
pd.read_excel :reads the excel files.\
pd.to_csv : writes the excel files.